# Pandas Introduction

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict={
    "name":["Alok","Prasoon","Vishnu","Rishi"],
    "marks":[9.56,9.3,9.3,9],
    "city":["Pune","Rajasthan","Himachal","Lucknow"]
}

In [3]:
df=pd.DataFrame(dict)

In [4]:
df

      name  marks       city
0     Alok   9.56       Pune
1  Prasoon   9.30  Rajasthan
2   Vishnu   9.30   Himachal
3    Rishi   9.00    Lucknow

In [5]:
# Dictionary to csv file with index
df.to_csv('Friends.csv')

In [6]:
# csv file without index 
df.to_csv('Friends_indexFalse.csv',index=False)

In [8]:
# To display the first n indexs from start we use df.head(n)
df.head(2)

      name  marks       city
0     Alok   9.56       Pune
1  Prasoon   9.30  Rajasthan

In [9]:
# To display the first n indexs from start we use df.tale(n)
df.tail(2)

     name  marks      city
2  Vishnu    9.3  Himachal
3   Rishi    9.0   Lucknow

In [10]:
# To display all the mathematical calculations for column that has integer
df.describe()

         marks
count  4.00000
mean   9.29000
std    0.22891
min    9.00000
25%    9.22500
50%    9.30000
75%    9.36500
max    9.56000

In [11]:
alok=pd.read_csv('alok.csv')

In [14]:
alok

   Train No  Speed       city
0     54651    266       Pune
1      8444    544  Rajasthan
2   4646464    151   Himachal
3    844884    545    Lucknow

In [13]:
alok.to_csv('alok.csv')